test_case/oil_water_separator/ready_for_simulation/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      blockMeshDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

vertices
(
    // ==== y-0, z-0 ==== //

    (-0.012 -0.012 -0.1)    // vertex-0
    (0.0 -0.012 -0.1)    // vertex-1
    (0.04 -0.012 -0.1)    // vertex-2
    (0.06 -0.012 -0.1)    // vertex-3
    (0.09 -0.012 -0.1)    // vertex-4
    (0.11 -0.012 -0.1)    // vertex-5
    (0.14 -0.012 -0.1)    // vertex-6
    (0.16 -0.012 -0.1)    // vertex-7
    (0.2 -0.012 -0.1)    // vertex-8

    // ==== y-1, z-0 ==== //

    (-0.012 0.0 -0.1)    // vertex-9
    (0.0 0.0 -0.1)    // vertex-10
    (0.04 0.0 -0.1)    // vertex-11
    (0.06 0.0 -0.1)    // vertex-12
    (0.09 0.0 -0.1)    // vertex-13
    (0.11 0.0 -0.1)    // vertex-14
    (0.14 0.0 -0.1)    // vertex-15
    (0.16 0.0 -0.1)    // vertex-16
    (0.2 0.0 -0.1)    // vertex-17

    // ==== y-2, z-0 ==== //

    (-0.012 0.05 -0.1)    // vertex-18
    (0.0 0.05 -0.1)    // vertex-19
    (0.04 0.05 -0.1)    // vertex-20
    (0.06 0.05 -0.1)    // vertex-21
    (0.09 0.05 -0.1)    // vertex-22
    (0.11 0.05 -0.1)    // vertex-23
    (0.14 0.05 -0.1)    // vertex-24
    (0.16 0.05 -0.1)    // vertex-25
    (0.2 0.05 -0.1)    // vertex-26

    // ==== y-3, z-0 ==== //

    (-0.012 0.07 -0.1)    // vertex-27
    (0.0 0.07 -0.1)    // vertex-28
    (0.04 0.07 -0.1)    // vertex-29
    (0.06 0.07 -0.1)    // vertex-30
    (0.09 0.07 -0.1)    // vertex-31
    (0.11 0.07 -0.1)    // vertex-32
    (0.14 0.07 -0.1)    // vertex-33
    (0.16 0.07 -0.1)    // vertex-34
    (0.2 0.07 -0.1)    // vertex-35

    // ==== y-4, z-0 ==== //

    (-0.012 0.09 -0.1)    // vertex-36
    (0.0 0.09 -0.1)    // vertex-37
    (0.04 0.09 -0.1)    // vertex-38
    (0.06 0.09 -0.1)    // vertex-39
    (0.09 0.09 -0.1)    // vertex-40
    (0.11 0.09 -0.1)    // vertex-41
    (0.14 0.09 -0.1)    // vertex-42
    (0.16 0.09 -0.1)    // vertex-43
    (0.2 0.09 -0.1)    // vertex-44

    // ==== y-5, z-0 ==== //

    (-0.012 0.1 -0.1)    // vertex-45
    (0.0 0.1 -0.1)    // vertex-46
    (0.04 0.1 -0.1)    // vertex-47
    (0.06 0.1 -0.1)    // vertex-48
    (0.09 0.1 -0.1)    // vertex-49
    (0.11 0.1 -0.1)    // vertex-50
    (0.14 0.1 -0.1)    // vertex-51
    (0.16 0.1 -0.1)    // vertex-52
    (0.2 0.1 -0.1)    // vertex-53

    // ==== y-6, z-0 ==== //

    (-0.012 0.112 -0.1)    // vertex-54
    (0.0 0.112 -0.1)    // vertex-55
    (0.04 0.112 -0.1)    // vertex-56
    (0.06 0.112 -0.1)    // vertex-57
    (0.09 0.112 -0.1)    // vertex-58
    (0.11 0.112 -0.1)    // vertex-59
    (0.14 0.112 -0.1)    // vertex-60
    (0.16 0.112 -0.1)    // vertex-61
    (0.2 0.112 -0.1)    // vertex-62

    // ==== y-1, z-1 ==== //

    (-0.012 -0.012 -0.01)    // vertex-63
    (0.0 -0.012 -0.01)    // vertex-64
    (0.04 -0.012 -0.01)    // vertex-65
    (0.06 -0.012 -0.01)    // vertex-66
    (0.09 -0.012 -0.01)    // vertex-67
    (0.11 -0.012 -0.01)    // vertex-68
    (0.14 -0.012 -0.01)    // vertex-69
    (0.16 -0.012 -0.01)    // vertex-70
    (0.2 -0.012 -0.01)    // vertex-71

    // ==== y-2, z-1 ==== //

    (-0.012 0.0 -0.01)    // vertex-72
    (0.0 0.0 -0.01)    // vertex-73
    (0.04 0.0 -0.01)    // vertex-74
    (0.06 0.0 -0.01)    // vertex-75
    (0.09 0.0 -0.01)    // vertex-76
    (0.11 0.0 -0.01)    // vertex-77
    (0.14 0.0 -0.01)    // vertex-78
    (0.16 0.0 -0.01)    // vertex-79
    (0.2 0.0 -0.01)    // vertex-80

    // ==== y-3, z-1 ==== //

    (-0.012 0.05 -0.01)    // vertex-81
    (0.0 0.05 -0.01)    // vertex-82
    (0.04 0.05 -0.01)    // vertex-83
    (0.06 0.05 -0.01)    // vertex-84
    (0.09 0.05 -0.01)    // vertex-85
    (0.11 0.05 -0.01)    // vertex-86
    (0.14 0.05 -0.01)    // vertex-87
    (0.16 0.05 -0.01)    // vertex-88
    (0.2 0.05 -0.01)    // vertex-89

    // ==== y-4, z-1 ==== //

    (-0.012 0.07 -0.01)    // vertex-90
    (0.0 0.07 -0.01)    // vertex-91
    (0.04 0.07 -0.01)    // vertex-92
    (0.06 0.07 -0.01)    // vertex-93
    (0.09 0.07 -0.01)    // vertex-94
    (0.11 0.07 -0.01)    // vertex-95
    (0.14 0.07 -0.01)    // vertex-96
    (0.16 0.07 -0.01)    // vertex-97
    (0.2 0.07 -0.01)    // vertex-98

    // ==== y-5, z-1 ==== //

    (-0.012 0.09 -0.01)    // vertex-99
    (0.0 0.09 -0.01)    // vertex-100
    (0.04 0.09 -0.01)    // vertex-101
    (0.06 0.09 -0.01)    // vertex-102
    (0.09 0.09 -0.01)    // vertex-103
    (0.11 0.09 -0.01)    // vertex-104
    (0.14 0.09 -0.01)    // vertex-105
    (0.16 0.09 -0.01)    // vertex-106
    (0.2 0.09 -0.01)    // vertex-107

    // ==== y-6, z-1 ==== //

    (-0.012 0.1 -0.01)    // vertex-108
    (0.0 0.1 -0.01)    // vertex-109
    (0.04 0.1 -0.01)    // vertex-110
    (0.06 0.1 -0.01)    // vertex-111
    (0.09 0.1 -0.01)    // vertex-112
    (0.11 0.1 -0.01)    // vertex-113
    (0.14 0.1 -0.01)    // vertex-114
    (0.16 0.1 -0.01)    // vertex-115
    (0.2 0.1 -0.01)    // vertex-116

    // ==== y-1, z-2 ==== //

    (-0.012 0.112 -0.01)    // vertex-117
    (0.0 0.112 -0.01)    // vertex-118
    (0.04 0.112 -0.01)    // vertex-119
    (0.06 0.112 -0.01)    // vertex-120
    (0.09 0.112 -0.01)    // vertex-121
    (0.11 0.112 -0.01)    // vertex-122
    (0.14 0.112 -0.01)    // vertex-123
    (0.16 0.112 -0.01)    // vertex-124
    (0.2 0.112 -0.01)    // vertex-125

    // ==== y-2, z-2 ==== //

    (-0.012 -0.012 0.01)    // vertex-126
    (0.0 -0.012 0.01)    // vertex-127
    (0.04 -0.012 0.01)    // vertex-128
    (0.06 -0.012 0.01)    // vertex-129
    (0.09 -0.012 0.01)    // vertex-130
    (0.11 -0.012 0.01)    // vertex-131
    (0.14 -0.012 0.01)    // vertex-132
    (0.16 -0.012 0.01)    // vertex-133
    (0.2 -0.012 0.01)    // vertex-134

    // ==== y-3, z-2 ==== //

    (-0.012 0.0 0.01)    // vertex-135
    (0.0 0.0 0.01)    // vertex-136
    (0.04 0.0 0.01)    // vertex-137
    (0.06 0.0 0.01)    // vertex-138
    (0.09 0.0 0.01)    // vertex-139
    (0.11 0.0 0.01)    // vertex-140
    (0.14 0.0 0.01)    // vertex-141
    (0.16 0.0 0.01)    // vertex-142
    (0.2 0.0 0.01)    // vertex-143

    // ==== y-4, z-2 ==== //

    (-0.012 0.05 0.01)    // vertex-144
    (0.0 0.05 0.01)    // vertex-145
    (0.04 0.05 0.01)    // vertex-146
    (0.06 0.05 0.01)    // vertex-147
    (0.09 0.05 0.01)    // vertex-148
    (0.11 0.05 0.01)    // vertex-149
    (0.14 0.05 0.01)    // vertex-150
    (0.16 0.05 0.01)    // vertex-151
    (0.2 0.05 0.01)    // vertex-152

    // ==== y-5, z-2 ==== //

    (-0.012 0.07 0.01)    // vertex-153
    (0.0 0.07 0.01)    // vertex-154
    (0.04 0.07 0.01)    // vertex-155
    (0.06 0.07 0.01)    // vertex-156
    (0.09 0.07 0.01)    // vertex-157
    (0.11 0.07 0.01)    // vertex-158
    (0.14 0.07 0.01)    // vertex-159
    (0.16 0.07 0.01)    // vertex-160
    (0.2 0.07 0.01)    // vertex-161

    // ==== y-6, z-2 ==== //

    (-0.012 0.09 0.01)    // vertex-162
    (0.0 0.09 0.01)    // vertex-163
    (0.04 0.09 0.01)    // vertex-164
    (0.06 0.09 0.01)    // vertex-165
    (0.09 0.09 0.01)    // vertex-166
    (0.11 0.09 0.01)    // vertex-167
    (0.14 0.09 0.01)    // vertex-168
    (0.16 0.09 0.01)    // vertex-169
    (0.2 0.09 0.01)    // vertex-170

    // ==== y-1, z-3 ==== //

    (-0.012 0.1 0.01)    // vertex-171
    (0.0 0.1 0.01)    // vertex-172
    (0.04 0.1 0.01)    // vertex-173
    (0.06 0.1 0.01)    // vertex-174
    (0.09 0.1 0.01)    // vertex-175
    (0.11 0.1 0.01)    // vertex-176
    (0.14 0.1 0.01)    // vertex-177
    (0.16 0.1 0.01)    // vertex-178
    (0.2 0.1 0.01)    // vertex-179

    // ==== y-2, z-3 ==== //

    (-0.012 0.112 0.01)    // vertex-180
    (0.0 0.112 0.01)    // vertex-181
    (0.04 0.112 0.01)    // vertex-182
    (0.06 0.112 0.01)    // vertex-183
    (0.09 0.112 0.01)    // vertex-184
    (0.11 0.112 0.01)    // vertex-185
    (0.14 0.112 0.01)    // vertex-186
    (0.16 0.112 0.01)    // vertex-187
    (0.2 0.112 0.01)    // vertex-188

    // ==== y-3, z-3 ==== //

    (-0.012 -0.012 0.1)    // vertex-189
    (0.0 -0.012 0.1)    // vertex-190
    (0.04 -0.012 0.1)    // vertex-191
    (0.06 -0.012 0.1)    // vertex-192
    (0.09 -0.012 0.1)    // vertex-193
    (0.11 -0.012 0.1)    // vertex-194
    (0.14 -0.012 0.1)    // vertex-195
    (0.16 -0.012 0.1)    // vertex-196
    (0.2 -0.012 0.1)    // vertex-197

    // ==== y-4, z-3 ==== //

    (-0.012 0.0 0.1)    // vertex-198
    (0.0 0.0 0.1)    // vertex-199
    (0.04 0.0 0.1)    // vertex-200
    (0.06 0.0 0.1)    // vertex-201
    (0.09 0.0 0.1)    // vertex-202
    (0.11 0.0 0.1)    // vertex-203
    (0.14 0.0 0.1)    // vertex-204
    (0.16 0.0 0.1)    // vertex-205
    (0.2 0.0 0.1)    // vertex-206

    // ==== y-5, z-3 ==== //

    (-0.012 0.05 0.1)    // vertex-207
    (0.0 0.05 0.1)    // vertex-208
    (0.04 0.05 0.1)    // vertex-209
    (0.06 0.05 0.1)    // vertex-210
    (0.09 0.05 0.1)    // vertex-211
    (0.11 0.05 0.1)    // vertex-212
    (0.14 0.05 0.1)    // vertex-213
    (0.16 0.05 0.1)    // vertex-214
    (0.2 0.05 0.1)    // vertex-215

    // ==== y-6, z-3 ==== //

    (-0.012 0.07 0.1)    // vertex-216
    (0.0 0.07 0.1)    // vertex-217
    (0.04 0.07 0.1)    // vertex-218
    (0.06 0.07 0.1)    // vertex-219
    (0.09 0.07 0.1)    // vertex-220
    (0.11 0.07 0.1)    // vertex-221
    (0.14 0.07 0.1)    // vertex-222
    (0.16 0.07 0.1)    // vertex-223
    (0.2 0.07 0.1)    // vertex-224

    // ==== y-1, z-4 ==== //

    (-0.012 0.09 0.1)    // vertex-225
    (0.0 0.09 0.1)    // vertex-226
    (0.04 0.09 0.1)    // vertex-227
    (0.06 0.09 0.1)    // vertex-228
    (0.09 0.09 0.1)    // vertex-229
    (0.11 0.09 0.1)    // vertex-230
    (0.14 0.09 0.1)    // vertex-231
    (0.16 0.09 0.1)    // vertex-232
    (0.2 0.09 0.1)    // vertex-233

    // ==== y-2, z-4 ==== //

    (-0.012 0.1 0.1)    // vertex-234
    (0.0 0.1 0.1)    // vertex-235
    (0.04 0.1 0.1)    // vertex-236
    (0.06 0.1 0.1)    // vertex-237
    (0.09 0.1 0.1)    // vertex-238
    (0.11 0.1 0.1)    // vertex-239
    (0.14 0.1 0.1)    // vertex-240
    (0.16 0.1 0.1)    // vertex-241
    (0.2 0.1 0.1)    // vertex-242

    // ==== y-3, z-4 ==== //

    (-0.012 0.112 0.1)    // vertex-243
    (0.0 0.112 0.1)    // vertex-244
    (0.04 0.112 0.1)    // vertex-245
    (0.06 0.112 0.1)    // vertex-246
    (0.09 0.112 0.1)    // vertex-247
    (0.11 0.112 0.1)    // vertex-248
    (0.14 0.112 0.1)    // vertex-249
    (0.16 0.112 0.1)    // vertex-250
    (0.2 0.112 0.1)    // vertex-251
);

blocks
(
    // ==== block-9__x-1_y-1_z-0 ==== //
    hex ( 10  11  20  19  73  74  83  82) (8 10 18) simpleGrading (1 1 1)

    // ==== block-10__x-2_y-1_z-0 ==== //
    hex ( 11  12  21  20  74  75  84  83) (3 10 18) simpleGrading (1 1 1)

    // ==== block-11__x-3_y-1_z-0 ==== //
    hex ( 12  13  22  21  75  76  85  84) (6 10 18) simpleGrading (1 1 1)

    // ==== block-13__x-5_y-1_z-0 ==== //
    hex ( 14  15  24  23  77  78  87  86) (6 10 18) simpleGrading (1 1 1)

    // ==== block-14__x-6_y-1_z-0 ==== //
    hex ( 15  16  25  24  78  79  88  87) (3 10 18) simpleGrading (1 1 1)

    // ==== block-15__x-7_y-1_z-0 ==== //
    hex ( 16  17  26  25  79  80  89  88) (8 10 18) simpleGrading (1 1 1)

    // ==== block-17__x-1_y-2_z-0 ==== //
    hex ( 19  20  29  28  82  83  92  91) (8 4 18) simpleGrading (1 1 1)

    // ==== block-18__x-2_y-2_z-0 ==== //
    hex ( 20  21  30  29  83  84  93  92) (3 4 18) simpleGrading (1 1 1)

    // ==== block-19__x-3_y-2_z-0 ==== //
    hex ( 21  22  31  30  84  85  94  93) (6 4 18) simpleGrading (1 1 1)

    // ==== block-20__x-4_y-2_z-0 ==== //
    hex ( 22  23  32  31  85  86  95  94) (4 4 18) simpleGrading (1 1 1)

    // ==== block-21__x-5_y-2_z-0 ==== //
    hex ( 23  24  33  32  86  87  96  95) (6 4 18) simpleGrading (1 1 1)

    // ==== block-22__x-6_y-2_z-0 ==== //
    hex ( 24  25  34  33  87  88  97  96) (3 4 18) simpleGrading (1 1 1)

    // ==== block-23__x-7_y-2_z-0 ==== //
    hex ( 25  26  35  34  88  89  98  97) (8 4 18) simpleGrading (1 1 1)

    // ==== block-25__x-1_y-3_z-0 ==== //
    hex ( 28  29  38  37  91  92 101 100) (8 3 18) simpleGrading (1 1 1)

    // ==== block-26__x-2_y-3_z-0 ==== //
    hex ( 29  30  39  38  92  93 102 101) (3 3 18) simpleGrading (1 1 1)

    // ==== block-27__x-3_y-3_z-0 ==== //
    hex ( 30  31  40  39  93  94 103 102) (6 3 18) simpleGrading (1 1 1)

    // ==== block-28__x-4_y-3_z-0 ==== //
    hex ( 31  32  41  40  94  95 104 103) (4 3 18) simpleGrading (1 1 1)

    // ==== block-29__x-5_y-3_z-0 ==== //
    hex ( 32  33  42  41  95  96 105 104) (6 3 18) simpleGrading (1 1 1)

    // ==== block-30__x-6_y-3_z-0 ==== //
    hex ( 33  34  43  42  96  97 106 105) (3 3 18) simpleGrading (1 1 1)

    // ==== block-31__x-7_y-3_z-0 ==== //
    hex ( 34  35  44  43  97  98 107 106) (8 3 18) simpleGrading (1 1 1)

    // ==== block-33__x-1_y-4_z-0 ==== //
    hex ( 37  38  47  46 100 101 110 109) (8 2 18) simpleGrading (1 1 1)

    // ==== block-34__x-2_y-4_z-0 ==== //
    hex ( 38  39  48  47 101 102 111 110) (3 2 18) simpleGrading (1 1 1)

    // ==== block-35__x-3_y-4_z-0 ==== //
    hex ( 39  40  49  48 102 103 112 111) (6 2 18) simpleGrading (1 1 1)

    // ==== block-36__x-4_y-4_z-0 ==== //
    hex ( 40  41  50  49 103 104 113 112) (4 2 18) simpleGrading (1 1 1)

    // ==== block-37__x-5_y-4_z-0 ==== //
    hex ( 41  42  51  50 104 105 114 113) (6 2 18) simpleGrading (1 1 1)

    // ==== block-38__x-6_y-4_z-0 ==== //
    hex ( 42  43  52  51 105 106 115 114) (3 2 18) simpleGrading (1 1 1)

    // ==== block-39__x-7_y-4_z-0 ==== //
    hex ( 43  44  53  52 106 107 116 115) (8 2 18) simpleGrading (1 1 1)

    // ==== block-50__x-2_y-0_z-1 ==== //
    hex ( 65  66  75  74 128 129 138 137) (3 2 4) simpleGrading (1 1 1)

    // ==== block-54__x-6_y-0_z-1 ==== //
    hex ( 69  70  79  78 132 133 142 141) (3 2 4) simpleGrading (1 1 1)

    // ==== block-57__x-1_y-1_z-1 ==== //
    hex ( 73  74  83  82 136 137 146 145) (8 10 4) simpleGrading (1 1 1)

    // ==== block-58__x-2_y-1_z-1 ==== //
    hex ( 74  75  84  83 137 138 147 146) (3 10 4) simpleGrading (1 1 1)

    // ==== block-59__x-3_y-1_z-1 ==== //
    hex ( 75  76  85  84 138 139 148 147) (6 10 4) simpleGrading (1 1 1)

    // ==== block-61__x-5_y-1_z-1 ==== //
    hex ( 77  78  87  86 140 141 150 149) (6 10 4) simpleGrading (1 1 1)

    // ==== block-62__x-6_y-1_z-1 ==== //
    hex ( 78  79  88  87 141 142 151 150) (3 10 4) simpleGrading (1 1 1)

    // ==== block-63__x-7_y-1_z-1 ==== //
    hex ( 79  80  89  88 142 143 152 151) (8 10 4) simpleGrading (1 1 1)

    // ==== block-65__x-1_y-2_z-1 ==== //
    hex ( 82  83  92  91 145 146 155 154) (8 4 4) simpleGrading (1 1 1)

    // ==== block-66__x-2_y-2_z-1 ==== //
    hex ( 83  84  93  92 146 147 156 155) (3 4 4) simpleGrading (1 1 1)

    // ==== block-67__x-3_y-2_z-1 ==== //
    hex ( 84  85  94  93 147 148 157 156) (6 4 4) simpleGrading (1 1 1)

    // ==== block-68__x-4_y-2_z-1 ==== //
    hex ( 85  86  95  94 148 149 158 157) (4 4 4) simpleGrading (1 1 1)

    // ==== block-69__x-5_y-2_z-1 ==== //
    hex ( 86  87  96  95 149 150 159 158) (6 4 4) simpleGrading (1 1 1)

    // ==== block-70__x-6_y-2_z-1 ==== //
    hex ( 87  88  97  96 150 151 160 159) (3 4 4) simpleGrading (1 1 1)

    // ==== block-71__x-7_y-2_z-1 ==== //
    hex ( 88  89  98  97 151 152 161 160) (8 4 4) simpleGrading (1 1 1)

    // ==== block-72__x-0_y-3_z-1 ==== //
    hex ( 90  91 100  99 153 154 163 162) (2 3 4) simpleGrading (1 1 1)

    // ==== block-73__x-1_y-3_z-1 ==== //
    hex ( 91  92 101 100 154 155 164 163) (8 3 4) simpleGrading (1 1 1)

    // ==== block-74__x-2_y-3_z-1 ==== //
    hex ( 92  93 102 101 155 156 165 164) (3 3 4) simpleGrading (1 1 1)

    // ==== block-75__x-3_y-3_z-1 ==== //
    hex ( 93  94 103 102 156 157 166 165) (6 3 4) simpleGrading (1 1 1)

    // ==== block-76__x-4_y-3_z-1 ==== //
    hex ( 94  95 104 103 157 158 167 166) (4 3 4) simpleGrading (1 1 1)

    // ==== block-77__x-5_y-3_z-1 ==== //
    hex ( 95  96 105 104 158 159 168 167) (6 3 4) simpleGrading (1 1 1)

    // ==== block-78__x-6_y-3_z-1 ==== //
    hex ( 96  97 106 105 159 160 169 168) (3 3 4) simpleGrading (1 1 1)

    // ==== block-79__x-7_y-3_z-1 ==== //
    hex ( 97  98 107 106 160 161 170 169) (8 3 4) simpleGrading (1 1 1)

    // ==== block-81__x-1_y-4_z-1 ==== //
    hex (100 101 110 109 163 164 173 172) (8 2 4) simpleGrading (1 1 1)

    // ==== block-82__x-2_y-4_z-1 ==== //
    hex (101 102 111 110 164 165 174 173) (3 2 4) simpleGrading (1 1 1)

    // ==== block-83__x-3_y-4_z-1 ==== //
    hex (102 103 112 111 165 166 175 174) (6 2 4) simpleGrading (1 1 1)

    // ==== block-84__x-4_y-4_z-1 ==== //
    hex (103 104 113 112 166 167 176 175) (4 2 4) simpleGrading (1 1 1)

    // ==== block-85__x-5_y-4_z-1 ==== //
    hex (104 105 114 113 167 168 177 176) (6 2 4) simpleGrading (1 1 1)

    // ==== block-86__x-6_y-4_z-1 ==== //
    hex (105 106 115 114 168 169 178 177) (3 2 4) simpleGrading (1 1 1)

    // ==== block-87__x-7_y-4_z-1 ==== //
    hex (106 107 116 115 169 170 179 178) (8 2 4) simpleGrading (1 1 1)

    // ==== block-92__x-4_y-5_z-1 ==== //
    hex (112 113 122 121 175 176 185 184) (4 2 4) simpleGrading (1 1 1)

    // ==== block-105__x-1_y-1_z-2 ==== //
    hex (136 137 146 145 199 200 209 208) (8 10 18) simpleGrading (1 1 1)

    // ==== block-106__x-2_y-1_z-2 ==== //
    hex (137 138 147 146 200 201 210 209) (3 10 18) simpleGrading (1 1 1)

    // ==== block-107__x-3_y-1_z-2 ==== //
    hex (138 139 148 147 201 202 211 210) (6 10 18) simpleGrading (1 1 1)

    // ==== block-109__x-5_y-1_z-2 ==== //
    hex (140 141 150 149 203 204 213 212) (6 10 18) simpleGrading (1 1 1)

    // ==== block-110__x-6_y-1_z-2 ==== //
    hex (141 142 151 150 204 205 214 213) (3 10 18) simpleGrading (1 1 1)

    // ==== block-111__x-7_y-1_z-2 ==== //
    hex (142 143 152 151 205 206 215 214) (8 10 18) simpleGrading (1 1 1)

    // ==== block-113__x-1_y-2_z-2 ==== //
    hex (145 146 155 154 208 209 218 217) (8 4 18) simpleGrading (1 1 1)

    // ==== block-114__x-2_y-2_z-2 ==== //
    hex (146 147 156 155 209 210 219 218) (3 4 18) simpleGrading (1 1 1)

    // ==== block-115__x-3_y-2_z-2 ==== //
    hex (147 148 157 156 210 211 220 219) (6 4 18) simpleGrading (1 1 1)

    // ==== block-116__x-4_y-2_z-2 ==== //
    hex (148 149 158 157 211 212 221 220) (4 4 18) simpleGrading (1 1 1)

    // ==== block-117__x-5_y-2_z-2 ==== //
    hex (149 150 159 158 212 213 222 221) (6 4 18) simpleGrading (1 1 1)

    // ==== block-118__x-6_y-2_z-2 ==== //
    hex (150 151 160 159 213 214 223 222) (3 4 18) simpleGrading (1 1 1)

    // ==== block-119__x-7_y-2_z-2 ==== //
    hex (151 152 161 160 214 215 224 223) (8 4 18) simpleGrading (1 1 1)

    // ==== block-121__x-1_y-3_z-2 ==== //
    hex (154 155 164 163 217 218 227 226) (8 3 18) simpleGrading (1 1 1)

    // ==== block-122__x-2_y-3_z-2 ==== //
    hex (155 156 165 164 218 219 228 227) (3 3 18) simpleGrading (1 1 1)

    // ==== block-123__x-3_y-3_z-2 ==== //
    hex (156 157 166 165 219 220 229 228) (6 3 18) simpleGrading (1 1 1)

    // ==== block-124__x-4_y-3_z-2 ==== //
    hex (157 158 167 166 220 221 230 229) (4 3 18) simpleGrading (1 1 1)

    // ==== block-125__x-5_y-3_z-2 ==== //
    hex (158 159 168 167 221 222 231 230) (6 3 18) simpleGrading (1 1 1)

    // ==== block-126__x-6_y-3_z-2 ==== //
    hex (159 160 169 168 222 223 232 231) (3 3 18) simpleGrading (1 1 1)

    // ==== block-127__x-7_y-3_z-2 ==== //
    hex (160 161 170 169 223 224 233 232) (8 3 18) simpleGrading (1 1 1)

    // ==== block-129__x-1_y-4_z-2 ==== //
    hex (163 164 173 172 226 227 236 235) (8 2 18) simpleGrading (1 1 1)

    // ==== block-130__x-2_y-4_z-2 ==== //
    hex (164 165 174 173 227 228 237 236) (3 2 18) simpleGrading (1 1 1)

    // ==== block-131__x-3_y-4_z-2 ==== //
    hex (165 166 175 174 228 229 238 237) (6 2 18) simpleGrading (1 1 1)

    // ==== block-132__x-4_y-4_z-2 ==== //
    hex (166 167 176 175 229 230 239 238) (4 2 18) simpleGrading (1 1 1)

    // ==== block-133__x-5_y-4_z-2 ==== //
    hex (167 168 177 176 230 231 240 239) (6 2 18) simpleGrading (1 1 1)

    // ==== block-134__x-6_y-4_z-2 ==== //
    hex (168 169 178 177 231 232 241 240) (3 2 18) simpleGrading (1 1 1)

    // ==== block-135__x-7_y-4_z-2 ==== //
    hex (169 170 179 178 232 233 242 241) (8 2 18) simpleGrading (1 1 1)

);

edges
(
);

boundary
(
    inlet
    {
        type    inlet;
        faces
        (
            (90 99 162 153)
        );
    }

    outlet_air
    {
        type    outlet;
        faces
        (
            (121 122 185 184)
        );
    }

    outlet_water
    {
        type    outlet;
        faces
        (
            (65 128 129 66)
        );
    }

    outlet_oil
    {
        type    outlet;
        faces
        (
            (69 132 133 70)
        );
    }
);

mergePatchPair
(
);
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
// Comments/Notes
//
//
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

