test_case/oil_water_separator/ready_for_simulation/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2412                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue alpha.air 1
    volScalarFieldValue alpha.water 0
    volScalarFieldValue alpha.oil 0
    volVectorFieldValue U (0 0 0)
);

regions
(
    boxToCell
    {
        // ### oil_zone    ### dimension in [m]
        type    seachableBox;
        min     (0.00  0.025  -0.11);
        max     (0.09  0.050   0.11);
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            volScalarFieldValue alpha.oil 1
            volScalarFieldValue alpha.air 0
        );
    }
    boxToCell
    {
        // ### water_zone    ### dimension in [m]
        type    seachableBox;
        min     (0.00  -0.020  -0.11);
        max     (0.09   0.025   0.11);
        fieldValues
        (
            volScalarFieldValue alpha.water 1
            volScalarFieldValue alpha.oil 0
            volScalarFieldValue alpha.air 0
        );
    }
    boxToCell
    {
        // ### mixture_zone    ### dimension in [m]
        type    seachableBox;
        min     (-0.02 0.050 -0.02);
        max     ( 0.00 0.100  0.02);
        fieldValues
        (
            volScalarFieldValue alpha.water 0.5
            volScalarFieldValue alpha.oil 0.5
            volScalarFieldValue alpha.air 0
        );
    }
);
